Tekla Open API Reference for Tekla Structures 2025
WpfSteelFinishComboBox.FinishProperty Field
 A dependency property that represents the finish value.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static readonly DependencyProperty FinishProperty
Public Shared ReadOnly FinishProperty As DependencyProperty
Field Value
Type: DependencyProperty
See Also
Reference
WpfSteelFinishComboBox Class
Tekla.Structures.Dialog.UIControls Namespace